app/controllers/users_controller.rb

INSERT INTO "users" ("country_code", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["country_code", "+91"], ["phone_number", 9099351959], ["created_at", "2021-11-12 05:52:50.192970"], ["updated_at", "2021-11-12 05:52:50.192970"]]
SELECT "users".* FROM "users" WHERE "users"."country_code" = $1 AND "users"."phone_number" = $2 LIMIT $3  [["country_code", "+91"], ["phone_number", 9099351959], ["LIMIT", 1]]
---
  def create
    if verify_otp_code?
      user = User.find_or_create_by(
        country_code: user_params[:country_code],
        phone_number: user_params[:phone_number]
      )